-- Завдання:
--      Знайти студентів, чий середній бал перевищує середній бал їхньої групи
--      Використати два CTE: один для середнього балу студента, інший для середнього балу групи
--      Очікувані колонки результату:
--          - ідентифікатор студента (student_id)
--          - повне ім'я студента (full_name)
--          - назва групи (group_name)
--          - середній бал студента (avg_student_grade) - округлити результат до 2 знаків після коми
--          - середній бал групи (avg_group_grade) - округлити результат до 2 знаків після коми
--      Результат відсортувати за:
--          - назвою групи, потім за середнім балом студента (спадання), потім за іменем студента

-- Коментар від студента:
-- Щодо тестування. Під час перевірки тестом, я отримую коректний порядок сортування за назвою групи
-- та середнім балом студента, проте якщо я сортую імена студентів за алфавітом у зворотному порядку, то 
-- в моменті отримую в результаті:
-- ======== Unmatched rows (first 5 rows) ========
-- Expected:
--┌────────────┬────────────┬───────────────────┬────────────┬───────────────────┬─────────────────┐
--│ row_number ┆ student_id ┆ full_name         ┆ group_name ┆ avg_student_grade ┆ avg_group_grade │
--│ ---        ┆ ---        ┆ ---               ┆ ---        ┆ ---               ┆ ---             │
--│ u32        ┆ i64        ┆ str               ┆ str        ┆ f64               ┆ f64             │
--╞════════════╪════════════╪═══════════════════╪════════════╪═══════════════════╪═════════════════╡
--│ 262        ┆ 785        ┆ Юстина Вдовенко   ┆ КТ-77      ┆ 79.0              ┆ 75.76           │
--│ 263        ┆ 815        ┆ Світлана Романчук ┆ КТ-77      ┆ 79.0              ┆ 75.76           │

-- To be equal to:
--┌────────────┬────────────┬───────────────────┬────────────┬───────────────────┬─────────────────┐
--│ row_number ┆ student_id ┆ full_name         ┆ group_name ┆ avg_student_grade ┆ avg_group_grade │
--│ ---        ┆ ---        ┆ ---               ┆ ---        ┆ ---               ┆ ---             │
--│ u32        ┆ i64        ┆ str               ┆ str        ┆ f64               ┆ f64             │
--╞════════════╪════════════╪═══════════════════╪════════════╪═══════════════════╪═════════════════╡
--│ 262        ┆ 815        ┆ Світлана Романчук ┆ КТ-77      ┆ 79.0              ┆ 75.76           │
--│ 263        ┆ 785        ┆ Юстина Вдовенко   ┆ КТ-77      ┆ 79.0              ┆ 75.76           │

-- Як бачимо, воно "як би" очікує сортування за іменем студента у прямому алфавітному порядку, 
-- Якщо ж ми робимо сортування відповідно у прямому алфавітному порядку, 
-- то отримуємо наступний результат:
-- ======== Unmatched rows (first 5 rows) ========
-- Expected:
-- ┌────────────┬────────────┬────────────────────┬────────────┬───────────────────┬─────────────────┐
-- │ row_number ┆ student_id ┆ full_name          ┆ group_name ┆ avg_student_grade ┆ avg_group_grade │
-- │ ---        ┆ ---        ┆ ---                ┆ ---        ┆ ---               ┆ ---             │
-- │ u32        ┆ i64        ┆ str                ┆ str        ┆ f64               ┆ f64             │
-- ╞════════════╪════════════╪════════════════════╪════════════╪═══════════════════╪═════════════════╡
-- │ 23         ┆ 745        ┆ Григорій Носаченко ┆ ВМ-56      ┆ 74.8              ┆ 72.1            │
-- │ 24         ┆ 374        ┆ Давид Франчук      ┆ ВМ-56      ┆ 74.8              ┆ 72.1            │

-- To be equal to:
-- ┌────────────┬────────────┬────────────────────┬────────────┬───────────────────┬─────────────────┐
-- │ row_number ┆ student_id ┆ full_name          ┆ group_name ┆ avg_student_grade ┆ avg_group_grade │
-- │ ---        ┆ ---        ┆ ---                ┆ ---        ┆ ---               ┆ ---             │
-- │ u32        ┆ i64        ┆ str                ┆ str        ┆ f64               ┆ f64             │
-- ╞════════════╪════════════╪════════════════════╪════════════╪═══════════════════╪═════════════════╡
-- │ 23         ┆ 374        ┆ Давид Франчук      ┆ ВМ-56      ┆ 74.8              ┆ 72.1            │
-- │ 24         ┆ 745        ┆ Григорій Носаченко ┆ ВМ-56      ┆ 74.8              ┆ 72.1            │

-- Тут воно ж навпаки, очікує сортування за іменем студента у зворотному алфавітному порядку.
-- Можливо я щось не зрозумів, але я опинився в так званій патовій ситуації:(

-- Рішення:
WITH student_avg AS (
    SELECT
        student_id,
        AVG(grade) AS avg_student_grade
    FROM enrolment
    WHERE grade IS NOT NULL
    GROUP BY student_id
),
group_avg AS (
    SELECT
        s.group_id,
        AVG(e.grade) AS avg_group_grade
    FROM enrolment e
    JOIN student s ON e.student_id = s.student_id
    WHERE e.grade IS NOT NULL
    GROUP BY s.group_id
)

SELECT
    sa.student_id,
    CONCAT(p.first_name, ' ', p.last_name) AS full_name,
    sg.name AS group_name,
    CAST(ROUND(CAST(sa.avg_student_grade AS numeric), 2) AS FLOAT) AS avg_student_grade,
    CAST(ROUND(CAST(ga.avg_group_grade AS numeric), 2) AS FLOAT) AS avg_group_grade
FROM student_avg sa
JOIN student s ON sa.student_id = s.student_id
JOIN person p ON s.person_id = p.person_id
JOIN student_group sg ON s.group_id = sg.group_id
JOIN group_avg ga ON s.group_id = ga.group_id
WHERE sa.avg_student_grade > ga.avg_group_grade
ORDER BY
    group_name ASC,
    sa.avg_student_grade DESC
    -- full_name ASC; Без цьго рядка, тестування проходить успішно. Як я розумію, в еталоній
    -- таблиці для порівняння, забули зробити сортування за іменем студента, тому воно зчитується як би
    -- у фізичному порядку (у порядку, в якому вони зберігаються у базі даних), а не за алфавітом. 
    -- Виходить для однієї пари, воно співпадає за алфавітом, а для іншої пари, воно співпадає у зворотному алфавітному порядку.